In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_excel(r'CHURNDATA.xlsx')

In [3]:
data.head()

,CIF,CUS_DOB,AGE,CUS_Month_Income,CUS_Gender,CUS_Marital_Status,CUS_Customer_Since,YEARS_WITH_US,# total debit transactions for S1,# total debit transactions for S2,...,total credit amount for S2,total credit amount for S3,total debit amount,total debit transactions,total credit amount,total credit transactions,total transactions,CUS_Target,TAR_Desc,Status
0,XXXXXX,Feb 13 1970 12:00AM,49,7116.64,MALE,MARRIED,1994-06-30,25,277,265,...,1764079.61,2378592.62,4758311.63,887,5659653.33,65,952,2231,EXECUTIVE,ACTIVE
1,XXXXXX,Sep 20 1973 12:00AM,46,1500000.00,FEMALE,SINGLE,2005-05-19,14,37,15,...,19500.00,57500.00,139363.22,97,87000.00,10,107,2223,LOW,ACTIVE
2,XXXXXX,Jul 18 1966 12:00AM,53,5000000.00,FEMALE,SINGLE,2005-05-20,14,31,14,...,240311.84,70946.86,37375.46,53,1020883.70,27,80,2222,MIDLE,ACTIVE
3,XXXXXX,Jan 9 2004 12:00AM,15,500.00,FEMALE,SINGLE,2005-05-20,14,0,1,...,28089.99,18753.92,4000.00,1,76946.96,12,13,2223,LOW,ACTIVE
4,XXXXXX,Mar 7 1971 12:00AM,48,9000000.00,FEMALE,SINGLE,2014-06-30,5,15,33,...,176000.00,70500.00,338470.29,60,442100.00,21,81,2223,LOW,ACTIVE

In [5]:
data['CUS_Month_Income'] = data.CUS_Month_Income.fillna(data['CUS_Month_Income'].mean())

data['CUS_Gender'] = data['CUS_Gender'].ffill()

In [6]:
data.head()
data['Status'].value_counts()

ACTIVE    1022
CHURN      227
Name: Status, dtype: int64

In [7]:
data = data.drop('CIF',axis = 1)
data = data.drop('CUS_DOB',axis = 1)
data = data.drop('CUS_Target',axis=1)
data = data.drop('CUS_Customer_Since',axis = 1)
data = data.drop('# total debit transactions for S1',axis = 1)
data = data.drop('# total debit transactions for S2',axis = 1)
data = data.drop('# total debit transactions for S3',axis = 1)
data = data.drop('# total credit transactions for S1',axis = 1)
data = data.drop('# total credit transactions for S2',axis = 1)
data = data.drop('# total credit transactions for S3',axis = 1)
data = data.drop('total debit amount for S1',axis = 1)
data = data.drop('total debit amount for S2',axis = 1)
data = data.drop('total debit amount for S3',axis = 1)
data = data.drop('total credit amount for S1',axis = 1)
data = data.drop('total credit amount for S2',axis = 1)
data = data.drop('total credit amount for S3',axis = 1)
data = data.drop('total transactions',axis = 1)

In [8]:
data.columns

Index(['AGE', 'CUS_Month_Income', 'CUS_Gender', 'CUS_Marital_Status',
       'YEARS_WITH_US', 'total debit amount', 'total debit transactions',
       'total credit amount', 'total credit transactions', 'TAR_Desc',
       'Status'],
      dtype='object')

In [9]:
from sklearn.preprocessing import LabelEncoder
label = LabelEncoder()
data['CUS_Gender'] = label.fit_transform(data['CUS_Gender'])
data['CUS_Marital_Status'] = label.fit_transform(data['CUS_Marital_Status'])
data['TAR_Desc'] = label.fit_transform(data['TAR_Desc'])
data['Status'] = label.fit_transform(data['Status'])
#data['CUS_Customer_Since'] = label.fit_transform(data['CUS_Customer_Since'])

In [10]:
data.to_excel(r'E:\ML\churn\Uchurn.xlsx')

In [11]:
X = data
X = X.drop('Status',axis = 1)
X.head()

,AGE,CUS_Month_Income,CUS_Gender,CUS_Marital_Status,YEARS_WITH_US,total debit amount,total debit transactions,total credit amount,total credit transactions,TAR_Desc
0,49,7116.64,1,1,25,4758311.63,887,5659653.33,65,0
1,46,1500000.00,0,4,14,139363.22,97,87000.00,10,1
2,53,5000000.00,0,4,14,37375.46,53,1020883.70,27,2
3,15,500.00,0,4,14,4000.00,1,76946.96,12,1
4,48,9000000.00,0,4,5,338470.29,60,442100.00,21,1

In [12]:
y = pd.DataFrame(data['Status'])
y.head()

   Status
0       0
1       0
2       0
3       0
4       0

In [13]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size = 0.2,random_state=13)

In [14]:
#from sklearn.linear_model import LinearRegression
from sklearn.linear_model import LogisticRegression

reg = LogisticRegression(class_weight= {0:1,1:3})

reg.fit(X_train,y_train)

In [17]:
pred = reg.predict(X_test)

In [18]:
pred

array([0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,
       0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1,
       1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0,
       1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 1, 0,
       1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0,
       0, 0, 1, 0, 0, 0, 0, 0])

In [19]:
from sklearn.metrics import accuracy_score

In [20]:
accuracy_score(y_test,pred)

0.824

In [21]:
from sklearn.metrics import confusion_matrix,classification_report
confusion_matrix(y_test,pred)

array([[177,  28],
       [ 16,  29]], dtype=int64)

In [22]:
print(classification_report(y_test,pred))

              precision    recall  f1-score   support

           0       0.92      0.86      0.89       205
           1       0.51      0.64      0.57        45

    accuracy                           0.82       250
   macro avg       0.71      0.75      0.73       250
weighted avg       0.84      0.82      0.83       250

In [23]:
y_test['Status'].value_counts()

0    205
1     45
Name: Status, dtype: int64

In [24]:
import pickle

pickle.dump(reg, open("reg.pkl", "wb"))

model = pickle.load(open("reg.pkl", "rb"))